Revit 2027 API
CutMarkType.CutLineDistance Property
 The distance between 2 cut lines.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double CutLineDistance { get; set; }
Public Property CutLineDistance As Double
	Get
	Set
public:
property double CutLineDistance {
	double get ();
	void set (double value);
}
member CutLineDistance : float with get, set
Property Value
Double
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: The given value for distanceBetweenTwoLines must be greater than 0 and no more than 30000 feet.
InvalidOperationException |  When setting this property: The cut mark type is not a double cut line type.
See Also
Reference
CutMarkType Class
Autodesk.Revit.DB.Architecture Namespace